[
  {
    "name": "Guess My Number",
    "desc": "\"Guess My Number!\" is a simple and interactive web-based game where players attempt to guess a randomly generated number between 1 and 20, with hints provided to guide their guesses.",
    "skills": ["JavaScript", "HTML5", "CSS3", "Game", "DOM manipulation"]
  },
  {
    "name": "Pig Game",
    "desc": "Pig Game is a fun, turn-based dice game where players compete to reach 100 points first. Roll the dice, hold your score, and avoid rolling a 1!",
    "skills": [
      "JavaScript",
      "HTML5",
      "CSS3",
      "Game",
      "DOM Manipulation",
      "Event Handling"
    ]
  },
  {
    "name": "Budgety",
    "desc": "Budgety is a budget management app that helps you track income and expenses, providing a clear financial overview for informed decision-making.",
    "skills": ["Budget", "Finance", "JavaScript", "DOM manipulation"]
  },
  {
    "name": "Bankist App",
    "desc": "A modern banking application with features like money transfers, loan requests, account management, and more.",
    "skills": ["banking", "JavaScript", "HTML", "CSS", "DOM manipulation"]
  },
  {
    "name": "Bankist Domain",
    "desc": "Bankist Domain is a modern bank website showcasing smooth scrolling, lazy loading, carousels, and responsive design.",
    "skills": [
      "HTML",
      "CSS",
      "JavaScript",
      "DOM Manipulation",
      "Lazy Loading",
      "Smooth Scrolling"
    ]
  },
  {
    "name": "Mapty",
    "desc": "Mapty is a workout app to track running and cycling workouts on a map. It features a modern, responsive interface and uses local storage for data persistence.",
    "skills": [
      "Workout",
      "JavaScript",
      "HTML5",
      "CSS3",
      "Local Storage",
      "DOM manipulation"
    ]
  },
  {
    "name": "Forkify",
    "desc": "Forkify is a recipe search engine with a modern UI, allowing users to find, save, and create recipes easily.",
    "skills": ["JavaScript", "HTML5", "CSS3", "API", "Parcel", "DOM manipulation"]
  },
  {
    "name": "Our Farm",
    "desc": "Our Farm API is a Node.js-based API designed to support the \"Our Farm\" shopping site, providing endpoints for retrieving detailed information about fresh goods such as vegetables and cheese.",
    "skills": [
      "Node.js",
      "API",
      "RESTful",
      "E-commerce",
      "Backend",
      "JavaScript",
      "JSON"
    ]
  },
  {
    "name": "Get Movie Recommendations",
    "desc": "Get Movie Recommendations is a responsive movie search engine that allows users to search by name, year, and type with real-time results.",
    "skills": [
      "movies",
      "OMDB-API",
      "JavaScript",
      "HTML5",
      "CSS3",
      "API-integration",
      "OOP"
    ]
  },
  {
    "name": "Clean Weather Client",
    "desc": "A sleek and modern weather search engine providing a 5-day forecast for any location with an interactive map and responsive design.",
    "skills": [
      "Weather",
      "Interactive Map",
      "API Integration",
      "JavaScript",
      "CSS3",
      "HTML5",
      "DOM manipulation"
    ]
  },
  {
    "name": "Cashier Client",
    "desc": "Cashier Client is a store management software offering secure user authentication, role-based access, product management, and feedback handling.",
    "skills": [
      "User Authentication",
      "Roles Restriction",
      "Node.js",
      "Express",
      "MongoDB",
      "JavaScript",
      "OOP"
    ]
  },
  {
    "name": "Todo App",
    "desc": "A responsive task management app using React, Node.js, and MongoDB. Features task creation, editing, deletion, and filtering.",
    "skills": ["React", "Node.js", "MongoDB", "Express", "Bootstrap", "REST API"]
  },
  {
    "name": "Natours",
    "desc": "Full-stack application designed for tour management, featuring a RESTful API and server-rendered pages. The app is fully optimized, allowing users to explore, book, and manage tours with a seamless experience.",
    "skills": [
      "Node.js",
      "Express",
      "MongoDB",
      "JWT",
      "Stripe",
      "RESTful API",
      "Geospatial",
      "SSR"
    ]
  },
  {
    "name": "Studybud",
    "desc": "A responsive forum for programmers to discuss topics, manage rooms, exchange messages, and view user profiles, built with Django, SQLite, and DRF.",
    "skills": ["Django", "SQLite", "Django Rest Framework", "Server side rendering"]
  },
  {
    "name": "Chat Verse",
    "desc": "Chat Verse is a Discord replica for organizing servers, channels, and conversations with text, voice, and video communication.",
    "skills": ["Next.js", "TypeScript", "Prisma", "WebSocket", "Chat", "mySQL"]
  },
  {
    "name": "Teva Naot",
    "desc": "Teva Naot Better Clone aims to modernize the e-commerce experience for the Israeli shoe brand Teva Naot",
    "skills": [
      "React",
      "Node.js",
      "MongoDB",
      "Mongoose",
      "Express",
      "Tailwind",
      "JavaScript",
      "Responsive design"
    ]
  },
  {
    "name": "A Vending Machine",
    "desc": "AVendingMachine is a modern web app showcasing vending machines with a responsive design, real-time data, and interactive UI.",
    "skills": [
      "React",
      "TypeScript",
      "Vite",
      "Tailwind",
      "Firebase",
      "ShadcnUi",
      "RTK"
    ]
  }
]
